fdr/src/test/resources/requests/nodoInviaRT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pagamenti.telematici.gov/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:nodoInviaRT>
            <identificativoIntermediarioPSP>{brokerPsp}</identificativoIntermediarioPSP>
            <identificativoCanale>{channel}</identificativoCanale>
            <password>{channelPwd}</password>
            <identificativoPSP>{psp}</identificativoPSP>
            <identificativoDominio>{pa}</identificativoDominio>
            <identificativoUnivocoVersamento>{iuv}</identificativoUnivocoVersamento>
            <codiceContestoPagamento>{ccp}</codiceContestoPagamento>
            <tipoFirma></tipoFirma>
            <rt>{rt}</rt>
        </ws:nodoInviaRT>
    </soapenv:Body>
</soapenv:Envelope>